#include <iostream>
/*
Задана последовательность неотрицательных целых чисел.
Требуется определить сумму элементов последовательности, завершающуюся первым встретившимся нолем (число 0 не входит в последовательность).

Входные данные
Входной файл INPUT.TXT содержит последовательность неотрицательных целых чисел, не превышающих значения 100.
Гарантируется, что во входных данных не более 100 чисел и среди них есть хотя бы одно число 0.

Выходные данные
В выходной файл OUTPUT.TXT выведите целое число – сумму элементов последовательности.
*/
using namespace std;
/*
main()
{
int s=0,a;
do{
cin>>a;
s+=a;
}
while (a);
cout<<s;
}
*/
