#include <iostream>
/*
Последовательностью Фибоначчи называется последовательность чисел a0, a1, ..., an, ..., где
a0 = 0, a1 = 1, ak = ak-1 + ak-2 (k > 1).

Требуется найти N-е число Фибоначчи.

Входные данные
Во входном файле INPUT.TXT записано целое число N (0 ≤ N ≤ 30).

Выходные данные
В выходной файл OUTPUT.TXT выведите N-е число Фибоначчи.
*/
using namespace std;
/*
main()
{
int n,a=0,b=1,c=0,i=0;
cin>>n;
while (i<n)
{
a=b;
b=c;
c=a+b;
i++;
}
cout<<c;
}
*/
