#include <iostream>
/*
На стандартной шахматной доске 8х8 заданы координаты двух клеток. Требуется определить: имеют ли данные клетки одинаковый цвет?

Входные данные
Входной файл INPUT.TXT содержит целые числа x1, y1, x2, y2, описывающие координаты двух клеток (x1,y1) и (x2,y2). Ограничения: 1 ≤ x1,y1,x2,y2 ≤ 8.

Выходные данные
В выходной файл OUTPUT.TXT выведите YES, если поля одного цвета, или слово NO в противном случае.
*/
using namespace std;
/*
main()
{

int x1,y1,x2,y2;
cin>>x1>>y1>>x2>>y2;

if (x1%2+y1%2==x2%2+y2%2||x1==y1&&x2==y2||x1%2==y1%2&&x2%2==y2%2||x2%2==y2%2&&x1%2==y1%2){
        cout<<"YES";
}
else{
    cout<<"NO";
}
}
*/
