#include <iostream>
/*
Однажды, посетив магазин канцелярских товаров, Вася купил X карандашей, Y ручек и Z фломастеров.
Известно, что цена ручки на 2 рубля больше цены карандаша и на 7 рублей меньше цены фломастера. Также известно, что стоимость карандаша составляет 3 рубля.
Требуется определить общую стоимость покупки.

Входные данные
В единственной строке входного файла INPUT.TXT записаны три натуральных числа X, Y и Z через пробел, каждое из которых не превышает 109.

Выходные данные
В выходной файл OUTPUT.TXT выведите одно целое число – стоимость покупки в рублях.
*/
using namespace std;
/*
main()
{
long long X,Y,Z;
cin >> X >> Y >> Z;
long long zX=3;
long long zY=zX+2;
long long zZ=zY+7;
long long sum=(zX*X)+(zY*Y)+(zZ*Z);
cout <<sum;
}
*/
