#include <iostream>
/*
Требуется определить последнюю цифру натурального числа.

Входные данные
Входной файл INPUT.TXT содержит натуральное число, не превосходящее 109.

Выходные данные
В выходной файл OUTPUT.TXT выведите последнюю цифру заданного числа.
*/
using namespace std;
/*
main() {
int a;
cin >> a ;
cout<<a%10;
}
*/
