#include <iostream>
using namespace std;
/*
Ќапишите программу, котора€ считывает целое число и выводит текст с упоминанием следующего и предыдущего дл€ него чисел.

¬ходные данные
¬ходной файл INPUT.TXT содержит целое число, не превосход€щее 1000 по абсолютной величине.

¬ыходные данные
¬ выходной файл OUTPUT.TXT выведите текст, аналогичный приведенному в примере. ѕри выводе следует учесть все пробелы и знаки препинани€.
*/
/*

main() {
int a;
cin >> a ;
cout<<"The next number for the number "<<a<<" is "<<a+1<<"."<<"\n";
cout<<"The previous number for the number "<<a<<" is "<<a-1<<"."<<"\n";
}
*/
