#include <iostream>
/*
Даны два натуральных числа. Требуется проверить: делится ли одно из них на другое?

Входные данные
Первая строка входного файла INPUT.TXT содержит два натуральных числа, разделенных пробелом. Числа не превосходят 100.

Выходные данные
В выходной файл OUTPUT.TXT выведите 1, если одно из чисел делится на другое нацело.
В противном случае следует вывести любое другое натуральное число, отличное от 1 и не превосходящее 109.
*/
using namespace std;
/*
main() {
int a,b;
cin >> a >> b;
if(a%b==0||b%a==0){
    cout<<1;
}else{
    cout<<666;
}
}
*/
