#include <iostream>
/*
Найдите сумму цифр трехзначного натурального числа.

Входные данные
Входной файл INPUT.TXT содержит трехзначное натуральное число.

Выходные данные
В выходной файл OUTPUT.TXT выведите сумму цифр заданного числа.
*/
using namespace std;
/*
main() {
int x;
cin >> x;
int a=x%10;
int b=(x/10)%10;
int c=x/100;
cout<<a+b+c;
}
*/
