#include <iostream>
/*
Требуется определить число десятков в заданном натуральном числе в его десятичной записи (то есть найти предпоследнюю цифру в числе).

Входные данные
Входной файл INPUT.TXT содержит натуральное число, не превосходящее 109.

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу.
*/
using namespace std;
/*
main() {
int a;
cin >> a;
cout<<(a / 10) % 10;
}
*/
