#include <iostream>
/*
Задан символ. Требуется определить: является ли он цифрой?

Входные данные
Входной файл INPUT.TXT содержит единственный символ (ASCII-код от 33 до 127).

Выходные данные
В выходной файл OUTPUT.TXT выведите «Yes», если символ является цифрой, и «No» в противном случае.
*/
using namespace std;
/*
int main()
{
    char c;
    cin >> c;
    if ('0' <= c && c <= '9')
        cout << "Yes";
    else
        cout << "No";
    return 0;
}
*/
