#include <iostream>
#include <vector>
/*
Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].

Входные данные
Первая строка входного файла INPUT.TXT содержит натуральное число N – количество элементов в массиве.
Во второй строке записаны N целых чисел Ai, разделенные пробелом. Третья строка содержит число X.
Все числа во входных данных не превосходят 1000 по абсолютной величине.

Выходные данные
В выходной файл OUTPUT.TXT выведите количество вхождений числа X в массив A.
*/
using namespace std;
/*
int main()
{
    int N, X, z = 0;
    cin >> N;
    vector <int> arr(N);
    for (int i = 0; i < N; i++)
        cin >> arr[i];
    cin >> X;
    for (int i = 0; i < N; i++)
        if (arr[i] == X)
            z++;
    cout << z;
    return 0;
}
*/
