#include <iostream>
/*
Дано три символа. Требуется определить, сколько из них являются цифрами.

При решении данной задачи необходимо реализовать функцию IsDigit(C), которая возвращает 1, если символ C – цифра, и 0 – иначе.

Входные данные
Входной файл INPUT.TXT содержит три символа, разделенные пробелом. Гарантируется, что ASCII-коды символов превышают 32.

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу.
*/
using namespace std;
/*
int IsDigit(char x){
    if ('0' <= x && x <= '9')
        return 1;
    return 0;
}

int main()
{
    char a, b, c;
    cin >> a >> b >> c;
    cout << IsDigit(a) + IsDigit(b) + IsDigit(c);
    return 0;
}
*/
