#include <iostream>

/*не решена
Требуется посчитать сумму целых чисел, расположенных между числами 1 и N включительно.

Входные данные
В единственной строке входного файла INPUT.TXT записано единственное целое число N, не превышающее по абсолютной величине 104.

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести одно целое число — сумму чисел, расположенных между 1 и N включительно.
*/
using namespace std;
/*


main()
{
int n,i,j,b,a,z=0;
cin >>n;
if (n>0 && n!=0)
{
for (i=1;i<=n;i++)

z+=i;
}
else
{
for (i=1;i>=n;i--)
z+=i;
}
cout <<z;
}
*/
