/*#include <iostream>
/*
В отделе работают 3 сотрудника, которые получают заработную плату в рублях. Требуется определить:
на сколько зарплата самого высокооплачиваемого из них отличается от самого низкооплачиваемого.

Входные данные
В единственной строке входного файла INPUT.TXT записаны размеры зарплат всех сотрудников через пробел.
Каждая заработная плата – это натуральное число, не превышающее 105.

Выходные данные
В выходной файл OUTPUT.TXT необходимо вывести одно целое число — разницу между максимальной и минимальной зарплатой.

*/
using namespace std;
/*
int main()
{
    int a, b, c;
    int maxZ;
    int minZ;
    cin >> a >> b >> c;
    if(a>c && a>b){
        maxZ=a;
        if(c > b){
            minZ=b;
        }else{
            minZ = c;
        }

    }if(b>a && b>c){
        maxZ=b;
        if(a > c){
            minZ=c;
        }else{
            minZ = a;
        }
    }if(c>a && c>b){
        maxZ=c;
        if(a > b){
            minZ=b;
        }else{
            minZ = a;
        }
    }
    cout << maxZ - minZ;
    return 0;
}*/
