#include <iostream>
/*
Требуется написать программу, определяющую, является ли четырехзначное натуральное число N палиндромом, т.е.
числом, которое одинаково читается слева направо и справа налево.

Входные данные
Входной файл INPUT.TXT содержит натуральное число N (1000 ≤ N ≤ 9999).

Выходные данные
В выходной файл OUTPUT.TXT следует вывести слово «YES», если число N является палиндромом, или «NO» – если нет.
*/
using namespace std;
/*
main()
{
int x;
cin>>x;
int x1,x2,x3,x4;
x4=x%10;
x3=x/10%10;
x2=x/100%10;
x1=x/1000;
if(x1 == x4 && x2 == x3){
    cout<<"YES";
}else{
    cout<<"NO";
}
}
*/
