#include <iostream>
/*
На свой день рождения Петя купил красивый и вкусный торт, который имел идеально круглую форму.
Петя не знал, сколько гостей придет на его день рождения, поэтому вынужден был разработать алгоритм,
согласно которому он сможет быстро разрезать торт на N равных частей. Следует учесть, что разрезы торта можно производить как по радиусу, так и по диаметру.

Помогите Пете решить эту задачу, определив наименьшее число разрезов торта по заданному числу гостей.

Входные данные
Входной файл INPUT.TXT содержит натуральное число N – число гостей, включая самого виновника торжества (N ≤ 1000).

Выходные данные
В выходной файл OUTPUT.TXT выведите минимально возможное число разрезов торта.
*/
using namespace std;/*
main()
{
int N;
cin>>N;
if(N==1){
    cout<<"0";
}else if(N%2!=0){
    cout<<N;
}else if(N%2==0){
    cout<<N/2;
}
}
*/
