/*#include <iostream>
/*
Известны результаты каждой из 4х четвертей баскетбольной встречи. Нужно определить победителя матча.
Побеждает команда, набравшая больше очков в течение всего матча.

Входные данные
Входной файл INPUT.TXT содержит 4 строки, в каждой строке находится два целых числа a и b – итоговый счет в соответствующей четверти.
а – количество набранных очков за четверть первой командой, b – количество очков, набранных за четверть второй командой. (0 ≤ a,b ≤ 100).

Выходные данные
В выходной файл OUTPUT.TXT выведите номер выигравшей команды, в случае ничьей следует вывести «DRAW».
*/
using namespace std;
/*
int main()
{
    int a, b;
    int numb1, numb2=0;
    cin >> a >> b;
    numb1=a,numb2=b;
    cin >> a >> b;
    numb1+=a,numb2+=b;
    cin >> a >> b;
    numb1+=a,numb2+=b;
    cin >> a >> b;
    numb1+=a,numb2+=b;
    if(numb1>numb2){
        cout <<1;
    }else if(numb1<numb2){
        cout <<2;
    }else{
        cout <<"DRAW";
    }


    return 0;
}
*/
