#include <iostream>
/*
Три толстяка решили поспорить: кто из них самый тяжелый. После взвешивания оказалось, что их масса соответственно M1, M2 и M3 килограмм.
Считается, что масса толстяка должна быть не менее 94 и не более 727 килограмм.

Помогите определить массу самого тяжелого из них, либо выяснить, что была допущена ошибка при взвешивании.

Входные данные
Входной файл INPUT.TXT содержит три целых числа M1, M2 и M3, разделенные пробелом. Все числа целые и не превосходят 10 000 по абсолютной величине.

Выходные данные
В выходной файл OUTPUT.TXT выведите массу самого тяжелого толстяка в случае корректного взвешивания, либо слово «Error» в противном случае.
*/
using namespace std;
/*
main()
{
int M1, M2, M3;
cin>>M1>>M2>>M3;
if(M1>=94 && M1<=727 && M2>=94 && M2<=727 && M3>=94 && M3<=727){
    cout<<max(max(M1,M2),M3);

}else{
   cout<<"Error";
}

}
*/
