#include <iostream>
/*
Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов,
а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

Входные данные
В единственной строке входного файла INPUT.TXT записано одно натуральное число S – общее количество сделанных журавликов (S < 106).

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести три числа, разделенных пробелами – количество журавликов,
которые сделал каждый ребенок (Петя, Катя и Сережа).
*/
/*using namespace std;

int main()
{
int sum;
int p,s,k,x;
cin >> sum;
sum==p+s+k;
p==s;
k==(s+p)*2;
x=p;
sum==x+x+((x+x)*2);
x=sum/6;

cout <<x<<" "<<(x+x)*2<<" "<<x;
    return 0;
}
*/
